x = parse(Int64, ARGS[1])
var_0 = (2139565331)
function func_0()
	function func_1(var_1,var_2,var_3,var_4,var_5,var_6,var_7,)
		return (1864191525)
		return true
	end
	var_8 = (1//512)
	if (true)
		var_9 = (true)
		var_10 = (0.4989034)
	end
	var_11 = ((17854262882565670028)<<func_1((1936243558488034469),func_1(((7)^(false)),(58368),(true),(99),(5951),(true),(43970),),((276482320)<(π)),(false),(true),(261641482),((63)==(0.744)),))
	var_12 = (87977201028268463293323408570426586373)
	return true
end
var_13 = (0.9755111)
var_14 = (-1766746779)
var_15 = ((9)≠(0.9363973883778935))
if (var_15*(false))
	var_0 = (0.5674)
	var_16 = (0.19045174)
	var_15 = (-2110757628)
	var_17 = ((-71801886699533814446973794225490844375)<<(false))
	var_18 = (23271)
	var_17 = (-29503 + 4437im)
	var_19 = (π)
end
var_15 = func_0()
var_20 = (13550)
var_21 = ((61815895129283463833110936434367015878)&var_14)
var_22 = (false)
var_23 = (16296392189799953844)
var_24 = (false)
var_25 = (Float16(0.5127) + Float16(0.4727)im)
if var_24
	var_22 = (0.41702314416922115)
	var_20 = (96630554439609624144492404373325322572)
	var_24 = (((false)&var_14)!=func_0())
	var_26 = (1602582123)
end
if (true)
	var_27 = (103)
	var_28 = (true)
	if (true)
		if (false)
		end
	elseif (~var_24)
		var_29 = (-34)
		var_30 = (1913824443)
		if (false)
			var_31 = (Float16(0.4863) + Float16(0.3955)im)
			var_21 = ((~(240))+var_21)
		end
		var_32 = ((!(true))*(π))
	elseif (~(true))
		var_24 = var_20
	end
	var_14 = (9768780177036777804)
	var_33 = (0.15163492302323367 + 0.0im)
	var_34 = (1)
	if (false)
	end
	var_35 = (-1820640841)
	if (!var_28)
		var_36 = (var_24≤(0.4639))
		function func_2(var_37,var_38,var_39,var_40,var_41,var_42,)
			if (true)
				var_43 = (5.0)
				var_44 = (1988485219)
				var_41 = (π)
			else
			var_42 = var_15
			end
			var_45 = (0.28864941654897414 + 0.0im)
			var_39 = (0.35196094357170105)
			var_46 = (0)
			return true
		end
	elseif ((6322975742975693624)<=(var_35==(true)))
		var_20 = (0.44798171039021706 + 0.0im)
		if ((~(false))^var_28)
			if (false)
				var_47 = (43937)
				var_48 = (25224)
				var_49 = ((125350300708492332342555294695747663665)>>var_28)
				var_14 = ((117)⊻(132643322937425552120725730337140775535))
				var_50 = (!(((false)*(true))|var_28))
				var_22 = (Float16(0.3447) + Float16(0.4004)im)
			end
		end
		var_51 = var_24
		if (false)
			function func_3(var_52,var_53,var_54,var_55,)
				var_56 = (Float16(0.2236) + Float16(0.6436)im)
				if (false)
					if (false)
						var_28 = (-31675 + 32580im)
					end
				elseif (false)
					var_57 = (-143940710474316835142502246929079861910)
				elseif (false)
					if (false)
						var_58 = (0.3072812870531989 + 0.0im)
					elseif (false)
					end
				elseif ((true)==(false))
					var_59 = (Float16(0.042) + Float16(0.9834)im)
					return (47)
				end
				var_54 = (0.72099996)
				return true
			end
			var_14 = (5103 - 18078im)
			var_60 = (196)
			var_61 = (18)
		end
	end
	if (!(true))
		if (((11869840013633125738)≥func_0())<(0.3984))
		end
	elseif (true)
	else
	var_62 = (+(0.01074))
	if (true)
	end
	var_63 = (false)
	var_64 = (18310734397879265701)
	var_65 = (15871)
	var_66 = (0.5561888861390745 + 0.0im)
	end
	var_35 = (6.0)
	var_27 = (751097028)
else
var_23 = var_23
var_67 = var_21
var_68 = ((3334)<=var_23)
var_69 = (0.5445878548225325)
var_70 = (+(π))
var_71 = (214885822577985212543366795713217811469)
var_72 = (0.39930715782642623 + 0.0im)
var_73 = (17495148774900607625)
var_74 = var_23
var_68 = (false)
var_68 = (3)
var_70 = (0.2217)
if (false)
	var_75 = ((π)*((89765987562127612461713062976878853098)&func_0()))
	var_76 = ((19)>=(0.0498))
end
if (((0.5896518)!=(-940272815))|(false))
	if (true)
		if ((true)^(true))
			var_77 = (23//44)
			var_23 = (-19918 - 30242im)
		end
		var_78 = (-(3521351284))
		var_79 = ((1297553810)^(var_70≠(3.0)))
		var_80 = (6552081396567348699)
		var_81 = (7999 - 16752im)
		var_74 = (29//38)
		var_82 = (-3877690858126957121)
		var_83 = ((0.5996272063813897)>(52148))
		var_84 = (true)
		var_85 = (3496570837205490390)
		var_86 = (-10266 + 17918im)
		function func_4(var_87,var_88,var_89,var_90,var_91,var_92,)
			return true
		end
	end
	var_93 = (99)
end
var_94 = (0.011533861633697517)
var_95 = (-6241 + 18452im)
var_96 = (0.6967728744390502)
var_97 = (!(false))
var_98 = var_14
var_99 = var_68
function func_5(var_100,var_101,var_102,var_103,var_104,)
	var_105 = (-8044760097952633276)
	return true
end
if (true)
	var_106 = ((33)==(true))
	var_97 = var_71
end
var_94 = (0.21274865672916232 + 0.0im)
var_72 = (0.844661202332535 + 0.0im)
var_73 = (186361521722051095598995990677340161055)
var_107 = (2.0)
var_108 = (false)
var_0 = (tand((259745942),)^((-1265521484)-(12//83)))
var_21 = (45//226)
var_108 = (495305933)
var_68 = ((-705875172)>>(6))
var_109 = ((-1501)⊻(12864))
if (false)
	var_107 = (6.0)
	var_110 = (3716048851)
	var_95 = (0.9852411552185818 + 0.0im)
	var_111 = (-23475 + 24672im)
	var_108 = (4410265440390994007)
	var_97 = (6)
	var_112 = (true)
	if (false)
	end
	if (true)
	else
	var_113 = (9014472690056755998)
	if var_112
	end
	if (true)
		function func_6(var_114,)
			var_109 = (0.398605709358516)
			var_112 = (false)
			return (4822)
			return true
		end
		if (true)
		end
	end
	var_115 = (((false)*(-65653493443949028579461797895081356546))<<(136))
	var_116 = (false)
	end
else
var_117 = (π)
var_118 = (-8173 - 30240im)
if (true)
	var_119 = (1605750216088818430)
	var_120 = (7842178304323078506)
	function func_7()
		return func_5((false),(9735),(2828352993860735818),(40223),(func_0()>(313741051448289643410609594504908461937)),)
		var_72 = (0.9843050214666198 + 0.0im)
		var_67 = (-5103 + 15541im)
		var_121 = (0.0064575974918807955 + 0.0im)
		return true
	end
	var_24 = (3)
	var_122 = ((4)≤(29880672767734138156879767395877866089))
	if (false)
	elseif (false)
	end
	var_123 = ((-9008618338388623128)⊻(68))
	var_124 = (var_109==(false))
	if (false)
		var_15 = (9142466077688253587)
		var_125 = ((-4139380009739724932)>>var_124)
	end
	var_126 = ((-2)<=(4.0))
end
var_127 = (var_108>>>(289298109431226755817961565252264628145))
var_128 = (4)
var_129 = (2)
if ((((2)>>>(-34847004627083889621596783651024037586))==((11370747161033731450)>>(false)))|(true))
	var_129 = (53//93)
	var_108 = (6578770415562038627)
end
if (true)
end
end
var_130 = (func_5((-8483746155842604557),(5),(true),(56116),(82),)≠(3.0))
if (true)
	var_131 = (13)
end
var_132 = (0.6867052241855831 + 0.0im)
var_133 = ((4.0)+(-27352911451536490852314428410011036747))
function func_8(var_134,var_135,)
	if ((28//79)>(false))
		var_130 = (18)
		var_136 = (0.8031029092439237 + 0.0im)
		var_137 = (var_129+(30015))
	end
	var_138 = (0.7190307738428157 + 0.0im)
	var_139 = ((var_71+(true))≥(6))
	var_140 = (true)
	if (true)
		if (!((true)^((true)!=(0.8095157529592565))))
		else
		var_141 = var_109
		var_142 = (870903575890892451)
		end
		var_143 = ((-14)≠(7729816385590457240))
		var_144 = (+(0.28182697))
	else
	var_145 = (180)
	var_139 = (-63)
	var_99 = (19//74)
	end
	var_140 = (false)
	var_146 = (57743807682795527030844486727910907844)
	function func_9(var_147,var_148,)
		var_149 = (false)
		var_150 = (true)
		var_151 = (-2078 - 16113im)
		if ((2010614810)≠func_0())
			function func_10()
				return true
			end
		end
		function func_11(var_152,)
			if var_149
			end
			if (((0.532)!=(π))≠(4))
				var_147 = (2)
				var_153 = sind((false),)
				var_154 = ((306162683239784832190135380576716257963)!=(6.0))
				var_155 = ((6)|(false))
			elseif ((false)*(false))
				var_156 = (Float16(0.4375) + Float16(0.4492)im)
				var_157 = (!(false))
				var_158 = (var_140==(var_157<(true)))
				var_159 = (17403)
				var_160 = (true)
			end
			if ((false)&(true))
			end
			function func_12(var_161,)
				var_68 = var_14
				return true
			end
			return true
		end
		var_162 = (9171025762184309336)
		return true
	end
	return true
end
var_163 = var_99
var_164 = ((59958)<<func_5((-8892487437566891721),((7858)-((23842)*(-1403996503))),((-(15538))^(false)),((91)+var_130),(26),))
function func_13(var_165,var_166,var_167,var_168,)
	if (false)
		var_169 = (Float16(0.2188) + Float16(0.457)im)
		var_170 = (+(true))
		var_130 = (-15454)
	end
	function func_14(var_171,var_172,)
		var_173 = (192)
		var_173 = (30696)
		var_174 = var_73
		var_175 = (295301466743150086269157441488124395578)
		return true
	end
	return true
end
var_71 = (((133485273654606561316817886522191734856)>=var_73)-(false))
var_176 = (-753)
var_177 = ((54184)<<(1))
var_178 = (0.527780216187852)
var_179 = ((195)<<(15781))
var_180 = var_107
var_21 = (13//15)
var_181 = var_176
if (true)
	var_182 = sind((var_99≤(3189692542)),)
	var_183 = (-1564404640)
	function func_15(var_184,var_185,var_186,var_187,)
		var_188 = ((+((48823)⊻(292198300945127020245704353191304565682)))>>>(140))
		return (175)
		function func_16(var_189,var_190,var_191,)
			var_73 = (0.7637818255879136)
			var_192 = (8907932532185511700)
			var_193 = var_184
			return true
		end
		function func_17(var_194,var_195,var_196,var_197,)
			return true
		end
		var_198 = (false)
		var_128 = var_69
		var_199 = (51291905215449373688588991702305214077)
		if (true)
			var_198 = (true)
		end
		var_198 = func_13((-32051),(true),(false),(-29064),)
		var_200 = ((true)==((false)==(false)))
		var_179 = (213085940)
		var_201 = ((119706388227880192071504921737297195468)>>(+func_0()))
		var_202 = (19//42)
		if (false)
			var_176 = (3584)
			var_130 = (-11471)
			function func_18(var_203,var_204,var_205,var_206,var_207,)
				var_208 = (5)
				var_209 = (true)
				var_210 = ((153495294820434777704785507724429220594)^(0.832106))
				var_211 = (false)
				var_211 = ((0.77107143)!=((37357)-(-1727876768)))
				return true
			end
			if (true)
			end
		end
		if (true)
			var_212 = (5712107648729248023)
			var_213 = ((-((4)<var_97))<(0.6553))
		end
		if (var_200*(true))
			var_214 = (239)
			var_185 = (0.823)
			function func_19(var_215,var_216,var_217,)
				return true
			end
			var_218 = (50484)
		elseif (false)
		elseif (true)
		end
		var_219 = (0.1592)
		if (false)
			var_163 = (-1828 - 28237im)
		end
		return true
	end
end
if (true)
	var_220 = var_180
	var_221 = (3.0)
	if (false)
		if (false)
		elseif (true)
			var_130 = var_97
			function func_20(var_222,)
				return true
			end
			var_223 = (150)
			var_224 = (0.7671070870201409 + 0.0im)
		end
	end
	var_225 = (16335479616702040291)
	var_226 = ((0.8235763733509731 + 0.0im)+(0.9441952647314265 + 0.0im))
end
if (true)
	var_227 = (16880)
	if (true)
		var_228 = (6720687747375561569)
		function func_21()
			if (true)
			elseif (true)
				var_227 = (π)
			else
			if (false)
			elseif (true)
				if (true)
					if (true)
						var_229 = ((1582722504)⊻(-(false)))
						var_179 = (((false)>>(((+(639593699))>>>(2550722191))≠(0.905656914726787)))^(var_74*((false)|var_164)))
					end
					if (false)
						var_230 = (0.747)
					end
					return (true)
					var_177 = (0.7635151703000291)
					var_231 = (96705452124911969657545413802584136046)
					var_232 = (+(π))
				end
				if (false)
					var_233 = (-28440 + 32072im)
					return (-737382197)
					var_234 = (64654)
				elseif (((true)≤(13988))⊻((false)|(true)))
					var_176 = func_8((false),(1572516033),)
					function func_22()
						var_235 = ((327193605333652584466392214927091015018)<(229466786379439466))
						var_15 = (0.49841990206715625 + 0.0im)
						var_236 = (!(false))
						var_237 = (!(true))
						return true
					end
					var_176 = (((-var_176)|(true))⊻(-((true)>>>(-943354931))))
				end
				var_238 = (6.0)
				if ((15428)<(((18877)>>(true))<<(286225725926412916574760527195058510615)))
				end
			end
			end
			return true
		end
	end
end
if ((3214876435692165911)≥(true))
end
var_239 = (53413452503907671354156539581065124233)
function func_23(var_240,var_241,var_242,)
	var_243 = (23474 - 19947im)
	var_241 = (((3)&((89)>=tan(func_13((25294),(true),var_242,(false),),)))*(0.7543352230870009 + 0.0im))
	return true
end
var_244 = (0.6924906)
var_68 = (0.8934698855873009 + 0.0im)
var_245 = (62077)
var_246 = (~(-30917))
var_247 = (21//43)
var_248 = (0.5730433873029908 + 0.0im)
function func_24(var_249,)
	var_250 = (-286365332)
	return true
end
var_239 = (169544129212476998049378213802544936358)
var_246 = (-71599872115403344702705367485112255052)
var_251 = (5.0)
if (true)
	var_252 = (0.373132762994437 + 0.0im)
	var_253 = (-16593 - 1372im)
	var_254 = (80)
	var_255 = ((27)+(4492))
	var_246 = var_0
elseif (false)
	if (true)
		var_71 = (0.739345384987705 + 0.0im)
	else
	var_256 = (-106)
	function func_25(var_257,var_258,var_259,var_260,var_261,var_262,var_263,)
		var_261 = (29//46)
		var_264 = (-22)
		if (true)
			var_265 = (206115962376942503272432947218464581681)
		end
		return true
	end
	var_266 = (0.3037)
	end
	var_267 = (0.913)
	var_268 = (4.0)
	var_269 = ((10321824643195730705)≠(1.0))
	var_270 = (func_13((true),(~((57857479890447170)<<(45747))),(-20520),(64351815),)!=var_181)
	function func_26(var_271,var_272,)
		var_273 = (1517915063)
		var_20 = (0.6435134953401804 + 0.0im)
		var_274 = (6496482916115078101)
		return true
	end
	var_275 = ((1535731796)>>>(-1033607429))
	var_276 = (((-25998 - 4305im)+(2171870358))-(0.59610665))
	var_270 = (false)
	var_277 = (0.6055072805316168 + 0.0im)
	var_278 = (Float16(0.6514) + Float16(0.08105)im)
	var_279 = ((3.0)>(19))
end
var_280 = (10840656855329645675)
var_176 = ((-3772345146163210326)-(252))
var_281 = (0.7841083619270055)
var_282 = (Float16(0.537) + Float16(0.2031)im)
end
var_130 = (0.0668440055299877 + 0.0im)
var_283 = (1244408765159816284)
var_280 = var_133
if ((0.786)==tand((7728),))
	var_176 = (167456228381601440582548918490250062179)
	var_284 = (24909)
	var_285 = (0.7332108218123154 + 0.0im)
	var_286 = (-8892519197228178928)
end
var_287 = (55)
var_288 = (0.22732160760966091 + 0.0im)
var_289 = (1657274534)
var_94 = (0.8347519244956181 + 0.0im)
var_290 = ((true)<(var_97⊻(28044)))
var_291 = (0.5384146)
var_292 = (-152781185141662720010497288423345427173)
var_293 = ((((0.8984)*(5199512393488897645812991678267843662))-(((false)!=(0.3057))≠((151991916118978183060428253276865346227)-(-37))))≤((44)&(true)))
var_294 = (-55533373040678134739976419258162628803)
var_127 = (0.6238750178065444)
var_287 = (-4270665619387336899)

tmpLog = open(string("/Users/harrisonankers/Documents/UNI/Year 4/FYP/Src/test_files/Process_0/log_files/log",(ARGS[2]),".txt"), "w")
write(tmpLog, string(var_0,",",var_13,",",var_14,",",var_15,",",var_20,",",var_21,",",var_22,",",var_23,",",var_24,",",var_25,",",var_67,",",var_68,",",var_69,",",var_70,",",var_71,",",var_72,",",var_73,",",var_74,",",var_94,",",var_95,",",var_96,",",var_97,",",var_98,",",var_99,",",var_107,",",var_108,",",var_109,",",var_117,",",var_118,",",var_127,",",var_128,",",var_129,",",var_130,",",var_132,",",var_133,",",var_163,",",var_164,",",var_176,",",var_177,",",var_178,",",var_179,",",var_180,",",var_181,",",var_239,",",var_244,",",var_245,",",var_246,",",var_247,",",var_248,",",var_251,",",var_280,",",var_281,",",var_282,",",var_283,",",var_287,",",var_288,",",var_289,",",var_290,",",var_291,",",var_292,",",var_293,",",var_294,",",0,"\n"))
close(tmpLog)
