x = parse(Int64, ARGS[1])
var_0 = (16813288943909209180)
if (true)
	var_0 = (6196520370238434534216066440092266985)
	var_1 = (-4570060398431227415)
	var_2 = (var_0<(π))
	var_1 = ((169493423412802192694502042963860934654)&(-40967289920665035174495253974189117493))
	if (true)
		var_3 = (88)
	else
	var_4 = (8062749105855565726)
	var_5 = (true)
	end
end
var_6 = (Float16(0.745) + Float16(0.168)im)
var_7 = cosd(var_0,)
if (false)
end
var_8 = (+(0.43454547967943613))
var_9 = ((23073518841317133396316486712760283254)⊻(true))
var_10 = (((true)!=(6.0))<<(-57030192573640357739892848030967322602))
if ((false)⊻((true)*(false)))
end
var_11 = (19285110413267219455019516383552295268)
var_10 = (0.5324575801229752)
var_12 = ((327108090094996259320908950373588033889)<(117336012245771506901438159099330096537))
var_13 = (2412383727)
var_12 = (25936)
var_14 = (-53)
if (true)
	var_15 = (49)
	var_0 = (38//53)
	if (false)
		var_16 = (11369732156657036697)
		var_17 = ((var_8<(63//377))^var_8)
	end
end
if (false)
	var_18 = ((81//91)-(-31207 - 28574im))
	if (~(false))
	end
	function func_0(var_19,var_20,var_21,var_22,var_23,var_24,)
		var_25 = (Float16(0.2803) + Float16(0.2012)im)
		if (true)
		end
		var_14 = (103)
		return true
	end
end
var_26 = (17//28)
var_27 = (0.7271801)
function func_1(var_28,var_29,var_30,var_31,var_32,var_33,var_34,)
	if ((false)|(false))
	end
	return true
end
if (true)
	if (true)
	elseif (true)
	end
	var_35 = func_1((413713925),(false),(35769),((0.6016)<((true)<(sind((-15737),)<cosd(((312630823584684894567151354371027244687)-(145)),)))),(7632),(2294686308),(-8539322568695463669),)
	var_36 = (true)
end
var_12 = (π)
var_37 = var_13
var_38 = (false)
var_37 = (0.34065584863683385 + 0.0im)
var_39 = (0.9297)
var_40 = (2921557576657098533)
var_41 = (307386000297610516871914525430265240936)
var_42 = (-22015 + 18049im)
var_38 = (false)
var_43 = (0.5260278823109108 + 0.0im)
var_44 = var_0
var_45 = (false)
var_46 = (462765879)
var_47 = (0.11736764821950585)
var_48 = (-6085890511246387675160517090811394588)
var_49 = (0.02527527909219729 + 0.0im)
var_50 = (-4592794813127363914)
var_45 = (0.576)
var_50 = (329963946539992626208208385905513629752)
var_51 = ((6168766615964256312)⊻(885))
var_38 = sind(((-7547073105928590724)|(6)),)
var_52 = (-444555900)
function func_2(var_53,var_54,var_55,var_56,var_57,var_58,var_59,)
	var_60 = (true)
	return true
end

tmpLog = open(string("/Users/harrisonankers/Documents/UNI/Year 4/FYP/Src/test_files/Process_0/log_files/log",(ARGS[2]),".txt"), "w")
write(tmpLog, string(var_0,",",var_6,",",var_7,",",var_8,",",var_9,",",var_10,",",var_11,",",var_12,",",var_13,",",var_14,",",var_26,",",var_27,",",var_37,",",var_38,",",var_39,",",var_40,",",var_41,",",var_42,",",var_43,",",var_44,",",var_45,",",var_46,",",var_47,",",var_48,",",var_49,",",var_50,",",var_51,",",var_52,",",0,"\n"))
close(tmpLog)
